<script type="application/ld+json">
{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [{
    "@type": "Question",
    "name": "How to find an apprenticeship?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "<p>We provide an official service to search through available apprenticeships. To get started, create an account here, specify the desired region, and your preferences. You will be able to search through all officially registered open apprenticeships.</p>"
    }
  }, {
    "@type": "Question",
    "name": "Whom to contact?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "You can contact the apprenticeship office through our official phone hotline above, or with the web-form below. We generally respond to written requests within 7-10 days."
    }
  }, {
    "@type": "Question",
    "name": "What are the requirements for an apprenticeship?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "The requirements vary depending on the specific apprenticeship program. Generally, you need to be at least 16 years old, have a high school diploma or equivalent, and meet any specific qualifications detailed in the apprenticeship listing."
    }
  }, {
    "@type": "Question",
    "name": "How long does an apprenticeship last?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "Apprenticeship durations vary depending on the profession and program specifics. Generally, they can last anywhere from 1 to 4 years."
    }
  }, {
    "@type": "Question",
    "name": "What kind of support can I expect during my apprenticeship?",
    "acceptedAnswer": {
      "@type": "Answer",
      "text": "Apprentices receive a wide range of support, including on-the-job training, mentorship from experienced professionals, and potentially classroom instruction related to their field. Additionally, you may have access to resources for balancing work and study, and other career development services."
    }
  }]
}
</script>